<p>- En el caso publicado con el enunciado hay un error en el archivo accionesEmpleados, se publica una nueva versi&oacute;n con las correcciones en el archivo accionesEmpleados1.</p><p>- Se ha cambiado el archivo formato.txt, l&iacute;neas 33 y 34, de tal forma que se contemple que los pagos realizados por el asociado son tanto para rentar o comprar como para cancelar multas por devoluci&oacute;n tard&iacute;a. </p><p>- En la primera p&aacute;gina del enunciado, &uacute;ltima frase del pen&uacute;ltimo parrafo, <u><strong>deber&iacute;a</strong></u> decir: &quot;Se tiene registro de los <strong>art&iacute;culos</strong> que actualmente tiene alquilados cada asociado, y la fecha en que deben ser devueltos cada uno de ellos&quot;.</p><p>- En el archivo con las acciones de los clientes, adem&aacute;s de las acciones de los clientes asociados cuyo formato est&aacute; descrito en formato.txt, se pueden tener acciones de clientes no asociados. Las posibles acciones son: i) seleccionar articulo para compra, denotado con 'c', incluye la c&eacute;dula, nombre del cliente, n&uacute;mero de telefono, y c&oacute;digo del art&iacute;culo; ii) pagar art&iacute;culos seleccionados, denotado con 'p', incluye c&eacute;dula y monto entregado; y iii) abandonar la tienda, denotado con 'b', incluye la c&eacute;dula del cliente. </p><p>- El enunciado es ambiguo respecto a considerar el genero de las series, pueden resolver esta ambig&uuml;edad tomando cualquiera de las dos alternativas.</p><p>- Aunque el enunciado menciona que el asociado puede declarar un art&iacute;culo como perdido, no se indica el formato para esto, se puede ignorar esta funcionalidad.</p><p>- Un asociado puede rentar art&iacute;culos incluso si no ha devuelto algunos cuya fecha de entrega ya ha pasado.</p><p>- Cuando un asociado devuelve un art&iacute;culo, &eacute;ste debe cancelar la multa asociada al mismo (de ser el caso). </p><p>- No es necesario proporcionar un men&uacute; para interactuar con el sistema, basta con la lectura y escritura de archivos tal como se menciona en el enunciado. En la documentaci&oacute;n deben indicar los par&aacute;metros y su orden con que se debe realizar la llamada al sistema.</p><p>- Cuando se procede a cobrar un art&iacute;culo perdido, s&oacute;lo se cobra el costo del art&iacute;culo (no se cobra la multa asociada). </p><p>- El dato correspondiente a secuela de una pel&iacute;cula es opcional, y en caso de estar presente se coloca al final, y es el nombre de la secuela. </p><p>- La informaci&oacute;n de los art&iacute;culos en prestamo a incluir en el archivo generado por sistema sigue el mismo formato indicado en formato.txt para art&iacute;culos existentes, pero adiciona como primer dato el c&oacute;digo del cliente que tiene el art&iacute;culo en custodia. </p>